# Q1

In [18]:
import pandas as pd
List=[4, 8, 15, 16, 23,42]
series=pd.Series(List)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2

In [19]:
import pandas as pd
var = [1,2,3,4,5,6,7,8,9,10]
var_series=pd.Series(var)
print(var_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3

In [20]:
import pandas as pd
df = pd.DataFrame(
{"Name":["Alice","Bob","Claire"],
 "Age":[25,30,27],
 "Gender":["Female","Male","Female"]
}
)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4

# pandas dataframe
Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
# difference
pandas dataframe is a 2 dimensional data structure and pandas series is one dimensional data structure.

In [21]:
# dataframe
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
# pandas.seeries
df["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

# Q5

columns(), head(), tail(), drop() etc.

In [31]:
# The head() function is used to get the first n rows.
n = 2
df.head(n)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

# Q6

# Series
It is a value mutable array.But it's size is immutable.
# dataframe
the dataframe is mutable.
# panel
It is a 3-D, size-mutable array.But it's value is immutable.

# Q7

In [33]:
# series1
series1 = pd.Series(["Jehad","Shawon","Himel","Akash"])
# series2
series2 = pd.Series([21,22,23,21,23])
# series3
series3 = pd.Series(["Data science","Bigdata","C++","Java"])
Data_frame = pd.DataFrame({"Name" : series1,"Age":series2,"course":series3})
Data_frame

     Name  Age        course
0   Jehad   21  Data science
1  Shawon   22       Bigdata
2   Himel   23           C++
3   Akash   21          Java
4     NaN   23           NaN